Please review and approve this deployment.
**Branch/Commit:** refs/heads/main / d72f44103c5e8b6a709b2ad428606ae20a094fc9
**Workflow run:** https://github.com/JohnMonteir0/LINUXtips-Giropops-Senhas/actions/runs/18169778870

**Plan (last ~500 lines):**
```
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_partition.current: Reading...
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
data.aws_caller_identity.current: Reading...
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_caller_identity.current: Reading...
module.eks_bottlerocket.data.aws_caller_identity.current[0]: Reading...
module.eks_bottlerocket.module.kms.data.aws_caller_identity.current[0]: Reading...
data.aws_availability_zones.available: Reading...
module.karpenter.data.aws_iam_policy_document.controller_assume_role[0]: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-095251b0d89b1c24f]
module.eks_bottlerocket.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.karpenter.data.aws_iam_policy_document.controller_assume_role[0]: Read complete after 0s [id=819195744]
module.eks_bottlerocket.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.karpenter.data.aws_caller_identity.current: Reading...
module.karpenter_disabled.data.aws_caller_identity.current: Reading...
module.karpenter_disabled.data.aws_partition.current: Reading...
module.karpenter.data.aws_partition.current: Reading...
module.karpenter.data.aws_partition.current: Read complete after 0s [id=aws]
module.karpenter_disabled.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks_bottlerocket.module.kms.data.aws_partition.current[0]: Reading...
module.eks_bottlerocket.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.karpenter.data.aws_region.current: Reading...
module.karpenter.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.karpenter_disabled.data.aws_region.current: Reading...
module.eks_bottlerocket.data.aws_partition.current[0]: Reading...
module.karpenter_disabled.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.eks_bottlerocket.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.karpenter.aws_iam_role.controller[0]: Refreshing state... [id=KarpenterController-20251001150004549300000002]
module.eks_bottlerocket.aws_iam_role.this[0]: Refreshing state... [id=cilium-cluster-20251001150004549500000003]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_caller_identity.current: Read complete after 0s [id=281145282112]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_role.this[0]: Refreshing state... [id=karpenter-node-group-20251001150004548100000001]
module.eks_bottlerocket.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=281145282112]
module.karpenter.data.aws_iam_policy_document.node_assume_role[0]: Reading...
module.karpenter.data.aws_iam_policy_document.node_assume_role[0]: Read complete after 0s [id=2560088296]
module.eks_bottlerocket.data.aws_iam_policy_document.custom[0]: Reading...
module.eks_bottlerocket.data.aws_iam_policy_document.custom[0]: Read complete after 0s [id=513122117]
module.eks_bottlerocket.aws_iam_policy.custom[0]: Refreshing state... [id=arn:aws:iam::281145282112:policy/cilium-cluster-20251001150004550400000004]
module.eks_bottlerocket.data.aws_caller_identity.current[0]: Read complete after 0s [id=281145282112]
module.eks_bottlerocket.data.aws_iam_session_context.current[0]: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=281145282112]
module.karpenter_disabled.data.aws_caller_identity.current: Read complete after 0s [id=281145282112]
module.karpenter.data.aws_caller_identity.current: Read complete after 0s [id=281145282112]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.eks_bottlerocket.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:sts::281145282112:assumed-role/gh-actions-role/gha-tf-plan-18169778870]
module.eks_bottlerocket.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=cilium-cluster-20251001150004549500000003-20251001150004974400000008]
module.eks_bottlerocket.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=cilium-cluster-20251001150004549500000003-20251001150004943200000006]
module.eks_bottlerocket.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=cilium-cluster-20251001150004549500000003-20251001150004946800000007]
module.eks_bottlerocket.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_instance_profile.this[0]: Refreshing state... [id=karpenter-node-group-20251001150004895100000005]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=karpenter-node-group-20251001150004548100000001-2025100115000505070000000b]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=karpenter-node-group-20251001150004548100000001-2025100115000503100000000a]
module.eks_bottlerocket.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3494160660]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=karpenter-node-group-20251001150004548100000001-20251001150004999300000009]
module.eks_bottlerocket.module.kms.aws_kms_key.this[0]: Refreshing state... [id=3ac0aa1c-9870-4de5-9800-efa651e90fc3]
module.eks_bottlerocket.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::281145282112:policy/cilium-cluster-ClusterEncryption20251001150026322700000012]
module.eks_bottlerocket.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/cilium]
module.eks_bottlerocket.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=cilium-cluster-20251001150004549500000003-20251001150026601400000013]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0610dff04d071c492]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-033efbabae2daa36c]
module.eks_bottlerocket.aws_security_group.cluster[0]: Refreshing state... [id=sg-06711d44a81713283]
aws_vpc_ipv4_cidr_block_association.pods: Refreshing state... [id=vpc-cidr-assoc-03257302ec82e7b68]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0943b7b0667012597]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0afd39d6758e029c7]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-073ed08af923402dd]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-01925bb1bae9a1bd1]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-06a480d1b4654d79f]
module.eks_bottlerocket.aws_security_group.node[0]: Refreshing state... [id=sg-047f04e6c5977a6be]
module.vpc.aws_route_table.intra[0]: Refreshing state... [id=rtb-05b8934ec8348eff9]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0657f03a2dbf3caae]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0701a05aca83335f0]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-09e4ef7754de8336c]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0c0d8848561f7bc62]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-07b219ba1169b0394]
module.vpc.aws_subnet.intra[0]: Refreshing state... [id=subnet-00ee7aa94e233d627]
module.vpc.aws_subnet.intra[1]: Refreshing state... [id=subnet-0a7fcc00556d8ab6e]
module.vpc.aws_subnet.intra[2]: Refreshing state... [id=subnet-02f17664ac0082cf6]
aws_subnet.pods["us-east-1c"]: Refreshing state... [id=subnet-01aa6d80b94148ea1]
aws_subnet.pods["us-east-1a"]: Refreshing state... [id=subnet-063b938703ccec1bf]
aws_subnet.pods["us-east-1b"]: Refreshing state... [id=subnet-0c85808229f03f22c]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0e9e3f79fdf45db9c]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0aaf15af1bc1e769a]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-08ddcc009842bcd58]
module.eks_bottlerocket.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-91022219]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-2938661562]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-807855050]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-2414885182]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-2628519199]
module.eks_bottlerocket.aws_security_group_rule.node["allow_icmp_from_vpc"]: Refreshing state... [id=sgrule-1366068364]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-405224109]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-2490974245]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-3947956981]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-339256003]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-1441686153]
module.eks_bottlerocket.aws_security_group_rule.node["allow_all_from_vpc"]: Refreshing state... [id=sgrule-4291323671]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0657f03a2dbf3caae1080289494]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0b0cc1494f0060b00]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-049b46fcc118129b7]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-087a695c7008f1cf8]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0a20b09efd71d268b]
module.vpc.aws_route_table_association.intra[2]: Refreshing state... [id=rtbassoc-0f57ecf72f1ccda94]
module.eks_bottlerocket.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-4050299129]
module.vpc.aws_route_table_association.intra[0]: Refreshing state... [id=rtbassoc-0a33a658a35783ccf]
module.vpc.aws_route_table_association.intra[1]: Refreshing state... [id=rtbassoc-03c70546dd35e5839]
aws_route_table_association.pods["us-east-1c"]: Refreshing state... [id=rtbassoc-07b6a7a5e5b4f1750]
aws_route_table_association.pods["us-east-1a"]: Refreshing state... [id=rtbassoc-00241866137b3e63e]
aws_route_table_association.pods["us-east-1b"]: Refreshing state... [id=rtbassoc-0261eee999998b73b]
module.eks_bottlerocket.aws_eks_cluster.this[0]: Refreshing state... [id=cilium]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0670ec8dff8255548]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-01925bb1bae9a1bd11080289494]
module.eks_bottlerocket.aws_ec2_tag.cluster_primary_security_group["Cluster"]: Refreshing state... [id=sg-0d8d0953258237207,Cluster]
module.eks_bottlerocket.aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-0d8d0953258237207,Environment]
module.eks_bottlerocket.aws_ec2_tag.cluster_primary_security_group["GithubRepo"]: Refreshing state... [id=sg-0d8d0953258237207,GithubRepo]
module.eks_bottlerocket.time_sleep.this[0]: Refreshing state... [id=2025-10-01T15:11:24Z]
module.eks_bottlerocket.data.tls_certificate.this[0]: Reading...
module.eks_bottlerocket.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=cilium:arn:aws:iam::281145282112:role/gh-actions-role]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_ssm_parameter.ami[0]: Reading...
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=754479210945577560]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_eks_access_entry.this[0]: Refreshing state... [id=cilium:arn:aws:iam::281145282112:role/karpenter-node-group-20251001150004548100000001]
module.eks_bottlerocket.data.tls_certificate.this[0]: Read complete after 1s [id=922877a0975ad078a65b8ff11ebc47b8311945c7]
module.eks_bottlerocket.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::281145282112:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/04A9870A41DD920821DF1A36BC73B348]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_ssm_parameter.ami[0]: Read complete after 1s [id=/aws/service/bottlerocket/aws-k8s-1.33/x86_64/latest/image_id]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_launch_template.this[0]: Refreshing state... [id=lt-04748edaf02ef91a3]
module.eks_bottlerocket.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=cilium#arn:aws:iam::281145282112:role/gh-actions-role#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_autoscaling_group.this[0]: Refreshing state... [id=karpenter-20251001151130089300000022]
aws_eks_addon.pod_identity_agent: Refreshing state... [id=cilium:eks-pod-identity-agent]
module.network.data.aws_eks_cluster_auth.this: Reading...
module.network.data.aws_eks_cluster_auth.this: Read complete after 0s [id=cilium]
module.karpenter.aws_iam_role.node[0]: Refreshing state... [id=cilium]
module.karpenter.aws_cloudwatch_event_rule.this["instance_rebalance"]: Refreshing state... [id=KarpenterInstanceRebalance-20251001151055755500000016]
module.network.data.aws_eks_cluster.this: Reading...
module.network.data.aws_caller_identity.current: Reading...
module.karpenter.aws_cloudwatch_event_rule.this["health_event"]: Refreshing state... [id=KarpenterHealthEvent-20251001151055755400000015]
module.karpenter.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/281145282112/Karpenter-cilium]
module.karpenter.aws_cloudwatch_event_rule.this["instance_state_change"]: Refreshing state... [id=KarpenterInstanceStateChange-20251001151055754600000014]
module.karpenter.aws_cloudwatch_event_rule.this["spot_interrupt"]: Refreshing state... [id=KarpenterSpotInterrupt-20251001151055756300000017]
module.karpenter.aws_eks_pod_identity_association.karpenter[0]: Refreshing state... [id=a-uou5olk6ngjjoftfd]
module.network.data.aws_caller_identity.current: Read complete after 0s [id=281145282112]
module.aws_auth.kubernetes_config_map.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
data.kubectl_file_documents.karpenter: Reading...
data.kubectl_file_documents.karpenter: Read complete after 0s [id=dd1b592a0d2070c1984b3238c4ce712a3de420b90d76f16569a8a624fd84e44a]
data.kubectl_file_documents.letsencrypt: Reading...
data.kubectl_file_documents.letsencrypt: Read complete after 0s [id=0d35e50690b8b7d4ff7e70e6ee54f4b6ea4d2673b7ecdf32ac7a89e94cb5eb7b]
module.network.data.aws_eks_cluster.this: Read complete after 1s [id=cilium]
module.network.helm_release.cilium: Refreshing state... [id=cilium]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=cilium-2025100115105625080000001c]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=cilium-2025100115105625990000001d]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEKS_CNI_Policy"]: Refreshing state... [id=cilium-2025100115105619370000001b]
module.karpenter.aws_iam_role_policy_attachment.node_additional["AmazonSSMManagedInstanceCore"]: Refreshing state... [id=cilium-2025100115105611720000001a]
module.karpenter.data.aws_iam_policy_document.queue[0]: Reading...
module.karpenter.data.aws_iam_policy_document.queue[0]: Read complete after 0s [id=3279256176]
module.karpenter.aws_sqs_queue_policy.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/281145282112/Karpenter-cilium]
module.karpenter.data.aws_iam_policy_document.v1[0]: Reading...
module.karpenter.data.aws_iam_policy_document.v033[0]: Reading...
module.karpenter.aws_cloudwatch_event_target.this["instance_rebalance"]: Refreshing state... [id=KarpenterInstanceRebalance-20251001151055755500000016-KarpenterInterruptionQueueTarget]
module.karpenter.aws_cloudwatch_event_target.this["instance_state_change"]: Refreshing state... [id=KarpenterInstanceStateChange-20251001151055754600000014-KarpenterInterruptionQueueTarget]
module.karpenter.aws_cloudwatch_event_target.this["health_event"]: Refreshing state... [id=KarpenterHealthEvent-20251001151055755400000015-KarpenterInterruptionQueueTarget]
module.karpenter.data.aws_iam_policy_document.v033[0]: Read complete after 0s [id=2462478541]
module.karpenter.aws_cloudwatch_event_target.this["spot_interrupt"]: Refreshing state... [id=KarpenterSpotInterrupt-20251001151055756300000017-KarpenterInterruptionQueueTarget]
module.karpenter.data.aws_iam_policy_document.v1[0]: Read complete after 0s [id=2732298653]
module.karpenter.data.aws_iam_policy_document.controller[0]: Reading...
module.karpenter.data.aws_iam_policy_document.controller[0]: Read complete after 0s [id=2462478541]
module.karpenter.aws_iam_policy.controller[0]: Refreshing state... [id=arn:aws:iam::281145282112:policy/KarpenterController-2025100115112156600000001e]
module.karpenter.aws_eks_access_entry.node[0]: Refreshing state... [id=cilium:arn:aws:iam::281145282112:role/cilium]
module.karpenter.aws_iam_role_policy_attachment.controller[0]: Refreshing state... [id=KarpenterController-20251001150004549300000002-2025100115112186920000001f]
module.aws_auth.kubernetes_config_map_v1_data.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
module.network.helm_release.tetragon: Refreshing state... [id=tetragon]
aws_eks_addon.coredns: Refreshing state... [id=cilium:coredns]
module.helm.data.aws_iam_policy_document.external_dns_policy: Reading...
module.helm.data.aws_subnets.public: Reading...
module.helm.data.aws_region.current: Reading...
module.helm.helm_release.karpenter: Refreshing state... [id=karpenter]
module.helm.data.aws_iam_policy_document.external_dns_policy: Read complete after 0s [id=2902363378]
module.helm.data.aws_iam_policy_document.lb_controller_policy: Reading...
module.helm.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.helm.data.aws_caller_identity.current: Reading...
module.helm.helm_release.external_dns: Refreshing state... [id=external-dns]
module.helm.aws_iam_policy.external_dns_policy: Refreshing state... [id=arn:aws:iam::281145282112:policy/eks-external-dns-policy]
module.helm.data.aws_iam_policy_document.lb_controller_policy: Read complete after 0s [id=458242647]
module.helm.aws_iam_policy.load_balancer_controller_policy: Refreshing state... [id=arn:aws:iam::281145282112:policy/eks-load-balancer-controller-policy]
module.helm.data.aws_caller_identity.current: Read complete after 0s [id=281145282112]
module.helm.aws_iam_role.eks_ebs_csi_controller: Refreshing state... [id=ebs-csi-controller-role]
module.helm.aws_iam_role.eks_load_balancer_controller: Refreshing state... [id=eks-load-balancer-controller-role]
module.helm.aws_iam_role.eks_external_dns: Refreshing state... [id=eks-external-dns-role]
module.helm.data.aws_subnets.public: Read complete after 0s [id=us-east-1]
module.helm.aws_iam_role_policy_attachment.attach_ebs_csi_policy: Refreshing state... [id=ebs-csi-controller-role-20251001151305842000000026]
module.helm.kubernetes_service_account.eks_ebs_csi_controller: Refreshing state... [id=kube-system/ebs-csi-controller-sa]
module.helm.aws_iam_role_policy_attachment.attach_load_balancer_policy: Refreshing state... [id=eks-load-balancer-controller-role-20251001151305766700000024]
module.helm.kubernetes_service_account.aws_load_balancer_controller: Refreshing state... [id=kube-system/aws-load-balancer-controller]
module.helm.aws_iam_role_policy_attachment.attach_external_dns_policy: Refreshing state... [id=eks-external-dns-role-20251001151305775000000025]
module.helm.kubernetes_service_account.external_dns: Refreshing state... [id=kube-system/external-dns]
module.helm.helm_release.ebs_csi_driver: Refreshing state... [id=aws-ebs-csi-driver]
module.helm.helm_release.aws_load_balancer_controller: Refreshing state... [id=aws-load-balancer-controller]
module.helm.helm_release.ingress-nginx: Refreshing state... [id=ingress-nginx]
module.helm.helm_release.cert_manager: Refreshing state... [id=cert-manager]
module.helm.helm_release.jaeger: Refreshing state... [id=jaeger]
module.helm.helm_release.argocd: Refreshing state... [id=argocd]
module.helm.helm_release.kube_prometheus_stack: Refreshing state... [id=kube-prometheus-stack]
module.helm.helm_release.otel_collector: Refreshing state... [id=otel-collector]
module.helm.helm_release.loki: Refreshing state... [id=loki]
module.helm.helm_release.tempo: Refreshing state... [id=tempo]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubectl_manifest.karpenter["/apis/karpenter.k8s.aws/v1/ec2nodeclasses/bottlerocket"] will be created
  + resource "kubectl_manifest" "karpenter" {
      + api_version             = "karpenter.k8s.aws/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "EC2NodeClass"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "bottlerocket"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: karpenter.k8s.aws/v1
            kind: EC2NodeClass
            metadata:
              name: bottlerocket
            spec:
              amiSelectorTerms:
              - alias: bottlerocket@latest
              blockDeviceMappings:
              - deviceName: /dev/xvdb
                ebs:
                  deleteOnTermination: true
                  encrypted: true
                  iops: 3000
                  volumeSize: 20Gi
                  volumeType: gp3
              role: cilium
              securityGroupSelectorTerms:
              - tags:
                  karpenter.sh/discovery: cilium
              subnetSelectorTerms:
              - tags:
                  karpenter.sh/discovery: cilium
              tags:
                karpenter.sh/discovery: cilium
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.karpenter["/apis/karpenter.sh/v1/nodepools/bottlerocket"] will be created
  + resource "kubectl_manifest" "karpenter" {
      + api_version             = "karpenter.sh/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "NodePool"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "bottlerocket"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: karpenter.sh/v1
            kind: NodePool
            metadata:
              name: bottlerocket
            spec:
              disruption:
                consolidateAfter: 30s
                consolidationPolicy: WhenEmpty
              limits:
                cpu: 5000
              template:
                metadata:
                  labels:
                    workload: apps
                spec:
                  nodeClassRef:
                    group: karpenter.k8s.aws
                    kind: EC2NodeClass
                    name: bottlerocket
                  requirements:
                  - key: node.kubernetes.io/instance-type
                    operator: In
                    values:
                    - t3.medium
                  - key: karpenter.sh/capacity-type
                    operator: In
                    values:
                    - on-demand
                  startupTaints:
                  - effect: NoSchedule
                    key: node.cilium.io/agent-not-ready
                    value: "true"
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.letsencrypt["/apis/cert-manager.io/v1/namespaces/cert-manager/clusterissuers/letsencrypt-staging"] will be created
  + resource "kubectl_manifest" "letsencrypt" {
      + api_version             = "cert-manager.io/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterIssuer"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "letsencrypt-staging"
      + namespace               = "cert-manager"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: cert-manager.io/v1
            kind: ClusterIssuer
            metadata:
              name: letsencrypt-staging
              namespace: cert-manager
            spec:
              acme:
                email: johnmonteiro78@yahoo.com
                privateKeySecretRef:
                  name: letsencrypt-staging
                server: https://acme-staging-v02.api.letsencrypt.org/directory
                solvers:
                - http01:
                    ingress:
                      ingressClassName: nginx
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.helm.helm_release.sonarqube will be created
  + resource "helm_release" "sonarqube" {
      + atomic                     = true
      + chart                      = "sonarqube"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "sonarqube"
      + namespace                  = "sonarqube"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://SonarSource.github.io/helm-chart-sonarqube"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + (sensitive value),
        ]
      + verify                     = false
      + version                    = "2025.5.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```
